import profileImage from "../../assets/images/ali-images/ali-profile.jpg";

export const aboutData = {
    title: "About me",
    image: {
        src: profileImage,
        alt: "Ali Sadeghi",
        width: 856,
        height: 856,
        zoom: 1.08,
    },
    paragraphsFA: [
        "سلام، من علی هستم. یک Software Developer که چیزهایی می‌سازه که واقعاً بهشون افتخار می‌کنه.",
        "استک اصلی من React و JavaScript هست.",
        "من عادت دارم چیزهایی که می‌سازم رو با کیفیت، دقت و ریزبینی جلو ببرم. برام مهمه پروژه فقط کار نکنه، بلکه قابل اعتماد باشه و پشتش فکر و ساختار وجود داشته باشه، مثل همین صفحه‌ای که دارین می‌بینین :)",
        "من خودم رو یک سازنده می‌بینم. برام خیلی مهم نیست چیزی که قراره ساخته بشه با چه استکی هست. اگر اون مسئله یا ایده برام مهم باشه، یاد می‌گیرمش، امتحانش می‌کنم و در نهایت می‌سازمش.",
        "تا الان بات‌های تلگرام، ابزارها و سیستم‌های مختلفی برای نیازهای شخصی خودم و شرکت‌هایی که توشون کار کردم ساختم. بعضی‌هاشون حتی وظیفه‌ی مستقیم من نبودن، ولی وقتی می‌دیدم مشکلی وجود داره یا چیزی می‌تونه بهتر کار کنه، می‌رفتم سراغش، می‌ساختمش، معرفیش می‌کردم و کمک می‌کردم بخشی از سیستم بهتر بشه.",
        "برای زندگی شخصی خودم هم ایجنت‌ها، ابزارک‌هایی ساختم که تو کارهای شخصی‌ام کمکم کنن. از ابزارهایی مربوط به کار و یادگیریم گرفته تا چیزهایی که برای ورزش، برنامه‌ریزی و بخش‌های شخصی‌تر زندگیم ساختم.",
        "تجربه‌ی کار تو تیم‌های نسبتاً بزرگ (~۵۰ نفر) رو داشتم. تیم‌های اجایل و غیر اجایل، جایی که می‌تونستم اثر خلق بکنم یا فقط تسک‌محور کار رو پیش ببرم.",
        "تو CS Internship می‌تونستم فقط یک اینترن معمولی باشم، بعد از تموم شدن دوره یادگیریم از برنامه خارج بشم، ولی موندم، بیشتر درگیر شدم و از یک جایی به بعد منتوری افراد تازه‌وارد رو انجام می‌دادم، تو ساختن سیستم‌ها و پروسه‌ها نقش داشتم و حتی وارد تیم مدیریتی برنامه شدم و مسیر برنامه رو هدایت می‌کردم.",
        "تو ملک‌رادار هم به عنوان یک کارآموز فرانت‌اند وارد شدم. بعد از حدود دو سال، رسیدم به جایی که مسئول ریویو و نظارت روی کار تیم فرانت‌اند بودم و تو چندین پروژه‌ی شرکت خلق ارزش کرده بودم و حتی کار آنبوردینگ به تیم هم می‌کردم.",
        "البته این خیلی به محیط و ساختار تیم هم بستگی داره. من وقتی بهتر عمل می‌کنم که جایی باشم که بهم اعتماد کنن، بهم فضا بدن و اجازه بدن رشد کنم و فقط به دید انجام‌دهنده‌ی تسک دیده نشم.",
        "در نهایت، من دنبال یک موقعیت شغلی معمولی نیستم. دنبال محیطی هستم که بتوانم علاقه، انرژی و توانم را صرف ساختن، حل مسئله و رشد دادن سیستم‌ها کنم.",
    ],
    paragraphsEN: ["Work in Progress..."],
    tags: ["React", "TypeScript", "Node.js", "AI Workflows", "Automation"],
};
